export const week_str = ["\u00A0", "월", "화", "수", "목", "금", "토", "일", "\u00A0"];
export const time_str = {
    alpha: {
        time:
            {
                daytime: [ 
                    "1A", "1B", "2A", "2B", "3A", "3B", "4A", "4B", "5A", "5B",
                    "6A", "6B", "7A", "7B", "8A", "8B", "9A", "9B",
                ],  
                night: [ "10A", "10B", "11A", "11B", "12A", "12B", "13A", "13B", "14A", "14B" ]
            },

        interval: [ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 
                    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 ], 
    },

    number: {
        time: 
            { 
                daytime: [ 
                    "9시", "9시 30분", "10시", "10시 30분", "11시", "11시 30분", 
                    "12시", "12시 30분", "13시", "13시 30분", "14시", "14시 30분", 
                    "15시", "15시 30분", "16시", "16시 30분", "17시", "17시 30분" 
                ],
                // 주간 (30분 단위 - minutes 남기기)

                night: [ 
                    "18시", "18시 25분", "18시 55분", "19시 20분", "19시 50분", "20시 15분", 
                    "20시 45분", "21시 10분", "21시 40분", "22시 05분" 
                ]
                // 야간 (25분 단위)
            },

        interval: [ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 
                    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 ],
    },
}
export const common_height = 50;
