export const week_str = ["\u00A0", "월", "화", "수", "목", "금", "토", "일", "\u00A0"];
export const time_str = {
    alpha: {
        time: [ "A", "B", "C", "D", "E", "F", "G", "H", "I" ].map((v) => v + "교시"),
        interval: [1, 1, 1, 1, 1, 1, 1, 1, 1],
    },

    number: {
        time: [ "9시", "9시 30분", "10시", "10시 30분", "11시", "11시 30분", 
                "12시", "12시 30분", "13시", "13시 30분", "14시", "14시 30분", 
                "15시", "15시 30분", "16시", "16시 30분", "17시", "17시 30분", 
                "18시", "18시 30분", "19시", "19시 30분", "20시", "20시 30분", 
                "21시", "21시 30분", "22시", "22시 30분"],
        interval: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    },
}
export const common_height = 50;
