export const NULL_STR = "\u00A0";

// CHANGE!!!
export const API_SERVER = "https://kmu-timtable-ivort.run.goorm.site";

export const MAIN_PATH = '/';
export const LOGIN_PATH = '/login';
export const SIGNUP_PATH = '/signup';
export const TIMETABLE_PATH = '/main/timetable';
export const EMPTYCLASSROOM_PATH = '/main/emptyclassroom';

export const WEEK_HEAD = [NULL_STR, "일", "월", "화", "수", "목", "금", "토", NULL_STR];
export const TIME_HEAD = {
    alpha: {
        daytime: {
            time: [ 
                "1A", "1B", "2A", "2B", "3A", "3B", "4A", "4B", "5A", "5B",
                "6A", "6B", "7A", "7B", "8A", "8B", "9A", "9B",
            ],
        },

        night: {
            time: [ 
                "10A", "10B", "11A", "11B", "12A", "12B", "13A", "13B",
                "14A", "14B"
            ],
        },
    },

    number: {
        daytime: {
            time: [ 
                "09:00", "09:30", "10:00", "10:30", "11:00", "11:30", 
                "12:00", "12:30", "13:00", "13:30", "14:00", "14:30", 
                "15:00", "15:30", "16:00", "16:30", "17:00", "17:30" 
            ],
        },

        night: {
            time: [ 
                "18:00", "18:25", "18:55", "19:20", "19:50", "20:15", 
                "20:45", "21:10", "21:40", "22:05" 
            ],
        },
    },
};

export const getUniversityName = (code) => { 
    return {
        "20428": "교양대학",
        "20430": "영어교양교과",
        "20434": "국어교양교과",
        "20442": "영어회화교과",
        "20443": "인문영역교과",
        "20444": "소통영역교과",
        "20445": "글로벌영역교과",
        "20446": "창의영역교과",
        "20447": "자유교양교과",
        "20491": "글쓰기",
        "20492": "영어읽기",
        "20493": "영여회화",
        "20494": "글로벌영어",
        "20495": "물리영역",
        "20496": "화학영역",
        "20497": "수학영역",
        "20498": "인문영역",
        "20499": "소통영역",
        "20500": "글로벌영역",
        "20501": "창의영역",
        "20502": "자유교양영역",
        "20503": "한국어교육영역",
        "20509": "필로소피아(교양심화)",
        "20536": "K-컬처(교양심화전공)",

        "20279": "글로벌인문·지역대학",
        "20287": "한국어문학부",
        "20288": "한국어문학부 국어국문학전공",
        "20289": "한국어문학부 글로벌한국어전공",
        "20290": "영어영문학부",
        "20291": "영어영문학부 영미어문전공",
        "20292": "영어영문학부 글로벌커뮤니케이션영어전공",
        "20293": "중국학부",
        "20294": "중국학부 중국어문전공",
        "20295": "중국학부 중국정경전공",
        "20296": "한국역사학과",
        "20297": "유라시아학과",
        "20298": "일본학과",

        "20010": "사회과학대학",
        "20504": "행정학과",
        "20273": "정치외교학과",
        "20277": "사회학과",
        "20531": "미디어·광고학부",
        "20532": "미디어·광고학부 미디어전공",
        "20533": "미디어·광고학부 광보홍보학전공",
        "20301": "교육학과",
        "20546": "러시아·유라시아학과",
        "20547": "일본학과",
        "20278": "행정관리학과",

        "20047": "법과대학",
        "20049": "법학부",
        "20050": "법학부 공법학전공",
        "20051": "법학부 사법학전공",
        "20435": "기업융합법학과",

        "20057": "경상대학",
        "20376": "경제학과",
        "20377": "국제통상학과",

        "20282": "창의공과대학",
        "20456": "신소재공학부",
        "20457": "신소재공학부 기계금속재료전공",
        "20458": "신소재공학부 전자화학재료전공",
        "20459": "기계공학부",
        "20549": "기계공학부 기계공학전공",
        "20463": "건설시스템공학부",
        "20464": "건설시스템공학부 건설시스템공학전공",
        "20465": "전자공학부",
        "20545": "전자공학부 지능형반도체융합전자전공",
        "20467": "전자공학부 전자시스템공학전공",
        "20535": "전자공학부 지능전자공학전공",

        "20158": "조형대학",
        "20161": "공업디자인학과",
        "20162": "시각디자인학과",
        "20166": "금속공예학과",
        "20167": "도자기공예학과",
        "20164": "의상디자인학과",
        "20453": "공간디자인학과",
        "20371": "영상디자인학과",
        "20419": "자동차·운송디자인학과",
        "20540": "AI디자인학과",

        "20285": "과학기술대학",
        "20473": "산림환경시스템학과",
        "20474": "임산생명공학과",
        "20475": "나노전자물리학과",
        "20510": "응용화학부",
        "20511": "나노소재전공",
        "20512": "바이오의약전공",
        "20477": "식품영양학과",
        "20478": "정보보안암호수학과",
        "20479": "바이오발효융합학과",

        "20223": "예술대학",
        "20225": "음악학부",
        "20226": "음악학부 성악전공",
        "20227": "음악학부 피아노전공",
        "20228": "음악학부 관현악전공",
        "20229": "음악학부 작곡전공",
        "20231": "미술학부",
        "20232": "미술학부 회화전공",
        "20233": "미술학부 입체미술전공",
        "20234": "공연예술학부",
        "20421": "공연예술학부 연극전공",
        "20422": "공연예술학부 영화전공",
        "20236": "공연예술학부 무용전공",
        "20247": "공연장",

        "20248": "체육대학",
        "20513": "스포츠교육학과",
        "20514": "스포츠산업레저학과",
        "20515": "스포츠건강재활학과",

        "20340": "경영대학",
        "20341": "경영학부",
        "20344": "경영학부 경영학전공",
        "20534": "경영학부 글로벌경영전공",
        "20384": "경영정보학부",
        "20390": "경영정보학부 경영정보전공",
        "20452": "KIBS",
        "20454": "KIBS International Business",
        "20516": "재무금융·회계학부",
        "20517": "재무금융·회계학부 재무금융전공",
        "20518": "재무금융·회계학부 회계학전공",
        "20541": "AI빅데이터융합경영학과",
        "20386": "기업경영학부",
        "20387": "기업경영학부 기업경영전공",

        "20284": "소프트웨어융합대학",
        "20470": "소프트웨어학부",
        "20471": "소프트웨어학부 소프트웨어전공",
        "20542": "인공지능학부",
        "20543": "인공지능학부 인공지능전공",

        "20391": "건축대학",
        "20393": "건축학부",
        "20394": "건축학부 건축설계전공",
        "20395": "건축학부 건축시스템전공",

        "20396": "자동차융합대학",
        "20399": "자동차공학과",
        "20398": "자동차IT융합학과",
        "20538": "미래자동차학부",
        "20539": "미래자동차학부 미래자동차전공",

        "20544": "미래모빌리티학과",
        "20548": "미래모빌리티학과",
        
        "20409": "교직과정부",
        "20410": "교직과정부",

        "20489": "인문기술융합학부",
        "20490": "인문기술융합학부",

        "20320": "연계전공",
        "20480": "연계전공 바이오헬스케어·식품연계전공",
        "20481": "연계전공 해외건설융합전공",
        "20482": "연계전공 자동차소프트웨어융합전공",
        "20483": "연계전공 Entrepreneurship융합전공",
        "20484": "연계전공 미래기술융합디자인전공",
        "20485": "연계전공 오픈소스거버넌스융합전공",
        "20486": "연계전공 소프트웨어광고융합전공",
        "20487": "연계전공 인포메이션테크놀로지전공",
        "20488": "연계전공 디지털엔터테인먼트전공",
        "20505": "연계전공 소프트웨어미디어융합전공",
        "20507": "연계전공 바이오4차산업거버넌스융합전공",
        "20508": "연계전공 과학기술사회융합전공",
        "20311": "연계전공 중국통상전공",
        "20312": "연계전공 일본경영",
        "20266": "연계전공 바이오산업개발",
        "20316": "연계전공 디스플레이디자인",
        "20314": "연계전공 공예제품디자인",
        "20313": "연계전공 실내제품디자인전공",
        "20317": "연계전공 패션제품및장신구",
        "20315": "연계전공 도덕·윤리전공",
        "20328": "연계전공 나노기술전공",
        "20329": "연계전공 바이오기술전공",
        "20356": "연계전공 UIT공학전공",
        "20357": "연계전공 나노바이오메카트닉스전공",
        "20358": "연계전공 Display공학",
        "20359": "연계전공 에너지·환경",
        "20412": "연계전공 해외건설",
        "20438": "연계전공 자동차소프트웨어디자인전공",
        "20439": "연계전공 CHC융합전공",
        "20441": "연계전공 Etrepreneurship전공",
        "20519": "연계전공 금융공학융합전공",
        "20520": "연계전공 문화예술경영학융합전공",
        "20521": "연계전공 미술·디자인사학융합전공",
        "20522": "연계전공 심리학전공",
        "20523": "연계전공 지식재산융합전공",
        "20524": "연계전공 문화예술사회학융합전공",
        "20525": "연계전공 미디어스포츠마케팅융합전공",
        "20526": "연계전공 경제·수학융합전공",
        "20527": "연계전공 데이터사이언스융합전공",
        "20528": "연계전공 식품경영학융합전공",
        "20529": "연계전공 응용심리학전공",
        "20530": "연계전공 미디어애널리스틱전공",
        "20537": "연계전공 미래자동차전공",
        "20550": "연계전공 디지털마케팅전공",
        "20551": "연계전공 바이오헬스산업융합전공",
        "20552": "연계전공 빅데이터경제학융합전공",
        "20553": "연계전공 스마트카ICT전공",
        "20554": "연계전공 미래자동차모빌리티연계전공",

        "20302": "세부전공",
        "20325": "세부전공 금융세부전공",
        "20326": "세부전공 비즈니스경제세부전공",
        "20327": "세부전공 산업세부전공",
        "20339": "세부전공 식품영양학세부전공",
        
        "20258": "학점교환생",
        "29998": "학과미배정",
    }[code];
};

export const getCategoryName = (code) => {
    return {
        "01": "전공필수",
        "02": "전공선택",
        "03": "교양필수",
        "04": "교양선택",
        "05": "",
        "06": "일반선택",
        "07": "부전공",
        "08": "교직",
        "09": "복수전공",
        "10": "교양기초",
        "11": "계열교양",
        "12": "학부(과)기초",
        "13": "학부전공",
        "14": "기초과목",
        "15": "공통필수",
        "16": "공통선택",
        "17": "교직선택",
        "18": "선수과목",
        "19": "2전공(계열교양)",
        "20": "2전공(학부기초)",
        "21": "2전공(전공)",
        "22": "3전공(계열교양)",
        "23": "3전공(학부기초)",
        "24": "3전공(전공)",
        "25": "사전이수",
        "26": "연계융합(학부기초)",
        "27": "연계융합(전공)",
        "28": "교양",
        "29": "선택",
        "30": "전공",
        "31": "스튜디오",
        "32": "코어",
        "33": "논문",
        "40": "기초교양",
        "41": "전공기초교양",
        "42": "핵심교양",
        "43": "자유교양",
        "44": "2전공(전공기초교양)",
        "45": "3전공(전공기초교양)",
        "99": "99",
        "XX": "XX"
    }[code];
}

export const common_height = 60;
